alplabai/gd32-bridge-firmware/tests/unit/adc_dsp/src/test_adc_dsp.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * Host-only regression for #69/#70: bridge_hw_adc_dsp_chain_bind() used to
 * validate a chain's SHAPE (ordering, blob well-formedness, contiguity) but
 * not the P1 runtime's CAPABILITY limits, which lived only in the FAC/FFT
 * config functions the pump calls -- so a chain those functions refuse
 * (multi-stage FIR/IIR, a cascaded IIR, a FIR ahead of a WINDOW+FFT
 * terminal, a second FFT-terminal bind against the single FFT block) bound
 * with BRIDGE_HW_OK and then starved silently forever.
 *
 * This links hal/gd32/adc_dsp_chain.c -- the chain pool + chain_bind split
 * out specifically because it is VENDOR-HEADER-FREE (touches no GD32
 * register) -- directly against a TEST-LOCAL definition of adc_streams[].
 * That is a feature, not a shortcut: driving `in_use` / `dsp_bound` /
 * `dsp_terminal` on the array by hand is exactly what is needed to reach
 * #70's double-bind and FAC/FFT contention paths without a running stream.
 *
 * What this suite CANNOT cover: adc_dsp_fac_config / adc_dsp_pump_stream /
 * adc_dsp_fft_config / adc_dsp_pump_fft stay in hal/gd32/adc_stream.c
 * because they touch RCU/FAC/FFT registers -- the pump interaction and the
 * `pump_raw_read` ownership-flip fix need a bench, not a host build.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <zephyr/ztest.h>

#include "adc_dsp_chain.h"
#include "bridge_hw.h"
#include "gd32_common.h"

/* Test-local definition of the extern adc_streams[] gd32_common.h declares
 * -- the real definition lives in hal/gd32/adc_stream.c, which this suite
 * deliberately does NOT link (it pulls "gd32g5x3.h").  Tests set in_use /
 * dsp_bound / dsp_terminal directly rather than going through
 * bridge_hw_adc_stream_begin, which lives in the unlinked file. */
adc_stream_state_t adc_streams[BRIDGE_ADC_STREAM_COUNT];

/* ---- fixtures --------------------------------------------------------- */

/* Return every chain slot to the pool and zero the stream array, so each
 * case starts from a clean pool + clean streams regardless of run order. */
static void reset_all(void)
{
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_CHAINS; ++i) {
		adc_dsp_chain_release(i);
	}
	memset(adc_streams, 0, sizeof(adc_streams));
}

/* Mark stream `sid` as a running, unbound ADC stream -- the precondition
 * chain_bind checks (`s->in_use` true, `s->dsp_bound` false) without
 * needing the real DMA/timer bring-up in bridge_hw_adc_stream_begin. */
static void stream_running(uint8_t sid)
{
	adc_streams[sid].in_use    = true;
	adc_streams[sid].dsp_bound = false;
}

static uint8_t open_chain(void)
{
	uint8_t chain_id = 0xFFu;

	zassert_equal(bridge_hw_adc_dsp_chain_open(&chain_id), BRIDGE_HW_OK, "chain_open failed");
	return chain_id;
}

static void
push_stage(uint8_t chain_id, uint8_t stage_index, uint8_t kind, const uint8_t *data, uint16_t len)
{
	int rv = bridge_hw_adc_dsp_stage_push(chain_id, stage_index, kind, 0u, len, data, len);
	zassert_equal(rv,
	              BRIDGE_HW_OK,
	              "stage_push(chain=%u idx=%u kind=%u) failed, got %d",
	              chain_id,
	              stage_index,
	              kind,
	              rv);
}

/* ---- per-kind blob builders (docs/gd32-bridge-protocol.md §3.x layout,
 * mirrored in hal/gd32/adc_dsp_chain.h's header comment) ---------------- */

/* FIR: format:u8 n_taps:u8 rsvd:u16 taps[n_taps*4].  `out` must be at
 * least 4 + n_taps*4 bytes; returns the blob's total size. */
static uint16_t fir_blob(uint8_t *out, uint8_t n_taps)
{
	out[0] = 1u; /* fmt = Q31 */
	out[1] = n_taps;
	out[2] = 0u;
	out[3] = 0u;
	for (uint8_t k = 0u; k < n_taps; ++k) {
		out[4u + k * 4u + 0u] = 0x00u;
		out[4u + k * 4u + 1u] = 0x00u;
		out[4u + k * 4u + 2u] = 0x00u;
		out[4u + k * 4u + 3u] = 0x10u; /* arbitrary nonzero Q31 tap */
	}
	return (uint16_t)(4u + (uint16_t)n_taps * 4u);
}

/* IIR: format:u8 n_sections:u8 rsvd:u16 coeffs[n_sec*5*4]. */
static uint16_t iir_blob(uint8_t *out, uint8_t n_sections)
{
	out[0] = 1u; /* fmt = Q31 */
	out[1] = n_sections;
	out[2] = 0u;
	out[3] = 0u;
	for (uint16_t k = 0u; k < (uint16_t)n_sections * 5u; ++k) {
		out[4u + k * 4u + 0u] = 0x00u;
		out[4u + k * 4u + 1u] = 0x00u;
		out[4u + k * 4u + 2u] = 0x00u;
		out[4u + k * 4u + 3u] = 0x10u;
	}
	return (uint16_t)(4u + (uint16_t)n_sections * 5u * 4u);
}

/* WINDOW: shape:u8 rsvd[3]. */
static uint16_t window_blob(uint8_t *out, uint8_t shape)
{
	out[0] = shape;
	out[1] = 0u;
	out[2] = 0u;
	out[3] = 0u;
	return 4u;
}

/* FFT: n_points:u16 out_fmt:u8 rsvd:u8. */
static uint16_t fft_blob(uint8_t *out, uint16_t n_points, uint8_t out_fmt)
{
	out[0] = (uint8_t)(n_points & 0xFFu);
	out[1] = (uint8_t)(n_points >> 8);
	out[2] = out_fmt;
	out[3] = 0u;
	return 4u;
}

ZTEST_SUITE(gd32_bridge_adc_dsp, NULL, NULL, NULL, NULL, NULL);

/* ===================================================================== *
 * #69 -- four shapes P1's FAC/FFT config functions refuse must now be
 * refused at BIND time (BRIDGE_HW_ERR_NOTIMPL), not accepted and left to
 * starve silently in the pump.
 * ===================================================================== */

ZTEST(gd32_bridge_adc_dsp, test_reject_two_stage_fir)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  blob[8];
	uint16_t len = fir_blob(blob, 1u);
	push_stage(chain_id, 0u, 0u /* FIR */, blob, len);
	push_stage(chain_id, 1u, 0u /* FIR */, blob, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(
	    rv, BRIDGE_HW_ERR_NOTIMPL, "two-stage FIR must be refused as NOTIMPL, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_reject_fir_then_iir)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  fir[8];
	uint16_t fir_len = fir_blob(fir, 1u);
	uint8_t  iir[24];
	uint16_t iir_len = iir_blob(iir, 1u);
	push_stage(chain_id, 0u, 0u /* FIR */, fir, fir_len);
	push_stage(chain_id, 1u, 1u /* IIR */, iir, iir_len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_ERR_NOTIMPL, "FIR+IIR must be refused as NOTIMPL, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_reject_iir_cascaded_sections)
{
	/* n_sections in 2..8 (P1 handles exactly 1) -- boundary + max. */
	const uint8_t cases[] = { 2u, 8u };

