alplabai/gd32-bridge-firmware/tests/unit/adc_dsp/src/test_adc_dsp.c
	for (size_t i = 0u; i < sizeof(cases) / sizeof(cases[0]); ++i) {
		reset_all();
		stream_running(0u);

		uint8_t  chain_id = open_chain();
		uint8_t  iir[4u + 8u * 5u * 4u];
		uint16_t len = iir_blob(iir, cases[i]);
		push_stage(chain_id, 0u, 1u /* IIR */, iir, len);

		int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
		zassert_equal(rv,
		              BRIDGE_HW_ERR_NOTIMPL,
		              "IIR n_sections=%u must be refused as NOTIMPL, got %d",
		              cases[i],
		              rv);
	}
}

ZTEST(gd32_bridge_adc_dsp, test_reject_fir_before_window_fft)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  fir[8];
	uint16_t fir_len = fir_blob(fir, 1u);
	uint8_t  win[4];
	uint16_t win_len = window_blob(win, 0u);
	uint8_t  fft[4];
	uint16_t fft_len = fft_blob(fft, 32u, 0u);
	push_stage(chain_id, 0u, 0u /* FIR */, fir, fir_len);
	push_stage(chain_id, 1u, 2u /* WINDOW */, win, win_len);
	push_stage(chain_id, 2u, 3u /* FFT */, fft, fft_len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv,
	              BRIDGE_HW_ERR_NOTIMPL,
	              "FIR ahead of a WINDOW+FFT terminal must be refused as NOTIMPL, got %d",
	              rv);
}

/* ===================================================================== *
 * Non-regression: the four shapes P1 DOES support must still bind.  This
 * is the real risk of tightening a validator -- do not skip it.
 * ===================================================================== */

ZTEST(gd32_bridge_adc_dsp, test_accept_single_fir)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  fir[8];
	uint16_t len = fir_blob(fir, 1u);
	push_stage(chain_id, 0u, 0u /* FIR */, fir, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_OK, "single FIR must still bind, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_accept_single_section_iir)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  iir[24];
	uint16_t len = iir_blob(iir, 1u);
	push_stage(chain_id, 0u, 1u /* IIR */, iir, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_OK, "1-section IIR must still bind, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_accept_window_fft)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  win[4];
	uint16_t win_len = window_blob(win, 1u);
	uint8_t  fft[4];
	uint16_t fft_len = fft_blob(fft, 64u, 1u);
	push_stage(chain_id, 0u, 2u /* WINDOW */, win, win_len);
	push_stage(chain_id, 1u, 3u /* FFT */, fft, fft_len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_OK, "WINDOW+FFT must still bind, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_accept_bare_fft)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  fft[4];
	uint16_t len = fft_blob(fft, 128u, 2u);
	push_stage(chain_id, 0u, 3u /* FFT */, fft, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_OK, "bare FFT must still bind, got %d", rv);
}

/* ===================================================================== *
 * #70 -- a second FFT-terminal bind must be refused (the FFT block is
 * single-instance, like the FAC); FFT-on-one-stream + FIR-on-the-other
 * must still both succeed, because the FAC and FFT blocks ARE independent
 * HW and only same-class contention is refused.
 * ===================================================================== */

ZTEST(gd32_bridge_adc_dsp, test_reject_second_fft_bind)
{
	reset_all();
	stream_running(0u);
	stream_running(1u);

	uint8_t  c0 = open_chain();
	uint8_t  fft0[4];
	uint16_t fft0_len = fft_blob(fft0, 32u, 0u);
	push_stage(c0, 0u, 3u /* FFT */, fft0, fft0_len);
	int rv0 = bridge_hw_adc_dsp_chain_bind(c0, 0u);
	zassert_equal(rv0, BRIDGE_HW_OK, "first FFT bind must succeed, got %d", rv0);

	uint8_t  c1 = open_chain();
	uint8_t  fft1[4];
	uint16_t fft1_len = fft_blob(fft1, 32u, 0u);
	push_stage(c1, 0u, 3u /* FFT */, fft1, fft1_len);
	int rv1 = bridge_hw_adc_dsp_chain_bind(c1, 1u);
	zassert_equal(rv1,
	              BRIDGE_HW_ERR_NOTIMPL,
	              "second FFT bind to the OTHER stream must be refused, got %d",
	              rv1);
}

ZTEST(gd32_bridge_adc_dsp, test_fft_and_fir_independent_blocks)
{
	reset_all();
	stream_running(0u);
	stream_running(1u);

	uint8_t  c0 = open_chain();
	uint8_t  fft0[4];
	uint16_t fft0_len = fft_blob(fft0, 32u, 0u);
	push_stage(c0, 0u, 3u /* FFT */, fft0, fft0_len);
	int rv0 = bridge_hw_adc_dsp_chain_bind(c0, 0u);
	zassert_equal(rv0, BRIDGE_HW_OK, "FFT bind on stream 0 must succeed, got %d", rv0);

	uint8_t  c1 = open_chain();
	uint8_t  fir1[8];
	uint16_t fir1_len = fir_blob(fir1, 1u);
	push_stage(c1, 0u, 0u /* FIR */, fir1, fir1_len);
	int rv1 = bridge_hw_adc_dsp_chain_bind(c1, 1u);
	zassert_equal(rv1,
	              BRIDGE_HW_OK,
	              "FIR bind on the OTHER stream must still succeed (FAC/FFT independent), got %d",
	              rv1);
}

/* ===================================================================== *
 * Ordering / contiguity / blob-validity / pool-exhaustion rules pre-date
 * #69/#70 and must still behave exactly as before the split + fix.
 * ===================================================================== */

ZTEST(gd32_bridge_adc_dsp, test_gap_in_stage_list_rejected)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  fir[8];
	uint16_t len = fir_blob(fir, 1u);
	push_stage(chain_id, 0u, 0u /* FIR */, fir, len);
	/* stage index 1 left empty -- stage 2 populated -> a gap. */
	push_stage(chain_id, 2u, 0u /* FIR */, fir, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_ERR_INVAL, "a gap in the stage list must reject, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_fft_not_terminal_rejected)
{
	reset_all();
	stream_running(0u);

	/* A populated stage after the FFT that is NOT a WINDOW -- deliberately
	 * not FFT-then-WINDOW, which would also trip the separate "WINDOW must
	 * directly precede FFT" rule (`fft_index == 0u` in that check) and mask
	 * whether THIS check, "FFT must be terminal", is the one doing the
	 * rejecting. */
	uint8_t  chain_id = open_chain();
	uint8_t  fft[4];
	uint16_t fft_len = fft_blob(fft, 32u, 0u);
	uint8_t  fir[8];
	uint16_t fir_len = fir_blob(fir, 1u);
	push_stage(chain_id, 0u, 3u /* FFT */, fft, fft_len);
	push_stage(chain_id, 1u, 0u /* FIR */, fir, fir_len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_ERR_INVAL, "FFT must be the terminal stage, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_window_without_fft_rejected)
{
	reset_all();
	stream_running(0u);

	uint8_t  chain_id = open_chain();
	uint8_t  win[4];
	uint16_t len = window_blob(win, 0u);
	push_stage(chain_id, 0u, 2u /* WINDOW */, win, len);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(
	    rv, BRIDGE_HW_ERR_INVAL, "WINDOW without a terminating FFT must reject, got %d", rv);
}

ZTEST(gd32_bridge_adc_dsp, test_malformed_fir_blob_rejected)
{
	reset_all();
	stream_running(0u);

	uint8_t chain_id = open_chain();
	uint8_t fir[4]   = { 1u, 0u, 0u, 0u }; /* n_taps = 0 -- invalid */
	push_stage(chain_id, 0u, 0u /* FIR */, fir, sizeof(fir));

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_ERR_INVAL, "n_taps=0 FIR blob must reject, got %d", rv);
}

