alplabai/gd32-bridge-firmware/tests/unit/adc_dsp/src/test_adc_dsp.c
ZTEST(gd32_bridge_adc_dsp, test_pool_exhaustion_returns_notimpl)
{
	reset_all();

	uint8_t chain_id = 0xFFu;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_CHAINS; ++i) {
		int rv = bridge_hw_adc_dsp_chain_open(&chain_id);
		zassert_equal(rv, BRIDGE_HW_OK, "chain %u should still be available, got %d", i, rv);
	}

	int rv = bridge_hw_adc_dsp_chain_open(&chain_id);
	zassert_equal(rv, BRIDGE_HW_ERR_NOTIMPL, "pool exhaustion must return NOTIMPL, got %d", rv);
}

/* ===================================================================== *
 * Second-pass review coverage gaps -- six clauses of the chain_bind
 * contract that a mutation pass found completely unpinned: each of the
 * six can be deleted from hal/gd32/adc_dsp_chain.c and this suite stays
 * green.  Every case below is proven against the code with its named
 * guard removed, per-case, as it lands.
 * ===================================================================== */

/* T1 -- the FAC-busy gate (bridge_hw_adc_dsp_chain_bind's `else` arm,
 * `if (adc_dsp_filter_stream_busy(stream_id)) return
 * BRIDGE_HW_ERR_NOTIMPL;`) has zero coverage.  #70 restructured the
 * single busy check into an if/else over FFT-terminal vs.
 * filter-terminal chains; test_reject_second_fft_bind above pins only
 * the `if` (FFT) half.  Mirrors that case exactly but for the FAC. */
ZTEST(gd32_bridge_adc_dsp, test_reject_second_fir_bind)
{
	reset_all();
	stream_running(0u);
	stream_running(1u);

	uint8_t  c0 = open_chain();
	uint8_t  fir0[8];
	uint16_t fir0_len = fir_blob(fir0, 1u);
	push_stage(c0, 0u, 0u /* FIR */, fir0, fir0_len);
	int rv0 = bridge_hw_adc_dsp_chain_bind(c0, 0u);
	zassert_equal(rv0, BRIDGE_HW_OK, "first FIR bind must succeed, got %d", rv0);

	uint8_t  c1 = open_chain();
	uint8_t  fir1[8];
	uint16_t fir1_len = fir_blob(fir1, 1u);
	push_stage(c1, 0u, 0u /* FIR */, fir1, fir1_len);
	int rv1 = bridge_hw_adc_dsp_chain_bind(c1, 1u);
	zassert_equal(rv1,
	              BRIDGE_HW_ERR_NOTIMPL,
	              "second FIR bind to the OTHER stream must be refused (FAC busy), got %d",
	              rv1);
}

/* T2 -- adc_dsp_fft_stream_busy's SELECTIVITY (its `dsp_terminal == 3u`
 * term) is unpinned: test_fft_and_fir_independent_blocks above binds
 * FFT-then-FIR, and that order never calls adc_dsp_fft_stream_busy at
 * all (the FIR bind takes the FAC-busy branch instead).  This is the
 * reverse order -- FIR-then-FFT -- which DOES consult it: mutating the
 * predicate to `in_use && dsp_bound` (dropping the dsp_terminal check,
 * so any bound stream reads as FFT-busy) makes the second bind below
 * wrongly see stream 0's FIR bind as FFT contention. */
ZTEST(gd32_bridge_adc_dsp, test_fir_then_fft_independent_blocks)
{
	reset_all();
	stream_running(0u);
	stream_running(1u);

	uint8_t  c0 = open_chain();
	uint8_t  fir0[8];
	uint16_t fir0_len = fir_blob(fir0, 1u);
	push_stage(c0, 0u, 0u /* FIR */, fir0, fir0_len);
	int rv0 = bridge_hw_adc_dsp_chain_bind(c0, 0u);
	zassert_equal(rv0, BRIDGE_HW_OK, "FIR bind on stream 0 must succeed, got %d", rv0);

	uint8_t  c1 = open_chain();
	uint8_t  fft1[4];
	uint16_t fft1_len = fft_blob(fft1, 32u, 0u);
	push_stage(c1, 0u, 3u /* FFT */, fft1, fft1_len);
	int rv1 = bridge_hw_adc_dsp_chain_bind(c1, 1u);
	zassert_equal(rv1,
	              BRIDGE_HW_OK,
	              "FFT bind on the OTHER stream must still succeed (FAC/FFT independent), got %d",
	              rv1);
}

/* T3 -- `if (!st->complete) return BRIDGE_HW_ERR_INVAL;` is the FIRST
 * clause of bridge_hw_adc_dsp_chain_bind's documented contract in
 * hal/bridge_hw.h ("the chain has unfinished (mid-upload) stages"), and
 * CMD_ADC_DSP_STAGE_PUSH is chunked specifically so a host can hit this
 * mid-upload -- yet nothing here ever bound against a partial upload
 * before this case. */
ZTEST(gd32_bridge_adc_dsp, test_incomplete_stage_bind_rejected)
{
	reset_all();
	stream_running(0u);

	uint8_t chain_id = open_chain();
	uint8_t chunk[4] = { 1u, 1u, 0u, 0u }; /* fmt=Q31, n_taps=1 -- half of an 8-byte FIR blob */
	int     push_rv  = bridge_hw_adc_dsp_stage_push(chain_id, 0u, 0u /* FIR */, 0u, 8u, chunk, 4u);
	zassert_equal(push_rv, BRIDGE_HW_OK, "partial push itself must succeed, got %d", push_rv);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(
	    rv, BRIDGE_HW_ERR_INVAL, "a mid-upload (incomplete) stage must reject bind, got %d", rv);
}

/* T4 -- `if (chunk_offset > chunk_total_size) return
 * BRIDGE_HW_ERR_RANGE;` in bridge_hw_adc_dsp_stage_push guards an
 * out-of-bounds write (F2, review of #69/#70): without it, `chunk_data_len
 * > (size_t)(chunk_total_size - chunk_offset)` promotes the subtraction
 * to `int`, which goes negative for chunk_offset > chunk_total_size and
 * then wraps to a huge size_t on the cast, so the guard silently passes
 * every out-of-range offset.  ASan reproduced the resulting OOB write in
 * st->data[] on exactly this sequence: chain_open, push offset=0
 * total=260 len=1, then push offset=60000 total=260 len=1. */
ZTEST(gd32_bridge_adc_dsp, test_chunk_offset_past_total_size_rejected)
{
	reset_all();
	stream_running(0u);

	uint8_t chain_id = open_chain();
	uint8_t byte     = 0xAAu;

	int rv0 = bridge_hw_adc_dsp_stage_push(chain_id, 0u, 0u /* FIR */, 0u, 260u, &byte, 1u);
	zassert_equal(rv0, BRIDGE_HW_OK, "first (opening) chunk must succeed, got %d", rv0);

	int rv1 = bridge_hw_adc_dsp_stage_push(chain_id, 0u, 0u /* FIR */, 60000u, 260u, &byte, 1u);
	zassert_equal(rv1,
	              BRIDGE_HW_ERR_RANGE,
	              "chunk_offset (60000) > chunk_total_size (260) must be RANGE, got %d",
	              rv1);
}

/* T5 -- multi-chunk assembly at a legitimate non-zero offset was
 * entirely uncovered: every push elsewhere in this suite goes through
 * push_stage(), which always uses chunk_offset == 0 -- the exact reason
 * the T4 chunk_offset > chunk_total_size defect survived as long as it
 * did.  Assemble one 8-byte FIR stage across two 4-byte chunks and check
 * both that bind succeeds and that the reassembled bytes are exactly
 * what was pushed -- a dropped `chunk_offset` in stage_push's copy loop
 * would overwrite bytes [0,4) twice instead of filling [4,8). */
ZTEST(gd32_bridge_adc_dsp, test_multi_chunk_assembly_succeeds)
{
	reset_all();
	stream_running(0u);

	uint8_t chain_id  = open_chain();
	uint8_t first[4]  = { 1u, 1u, 0u, 0u };             /* fmt=Q31 n_taps=1 rsvd=0 */
	uint8_t second[4] = { 0x00u, 0x00u, 0x00u, 0x10u }; /* tap[0], arbitrary nonzero Q31 */

	int rv0 = bridge_hw_adc_dsp_stage_push(chain_id, 0u, 0u /* FIR */, 0u, 8u, first, 4u);
	zassert_equal(rv0, BRIDGE_HW_OK, "first chunk push must succeed, got %d", rv0);
	int rv1 = bridge_hw_adc_dsp_stage_push(chain_id, 0u, 0u /* FIR */, 4u, 8u, second, 4u);
	zassert_equal(rv1, BRIDGE_HW_OK, "second chunk push must succeed, got %d", rv1);

	int rv = bridge_hw_adc_dsp_chain_bind(chain_id, 0u);
	zassert_equal(rv, BRIDGE_HW_OK, "two-chunk FIR assembly must bind, got %d", rv);

	uint8_t expect[8];
	memcpy(expect, first, sizeof(first));
	memcpy(expect + sizeof(first), second, sizeof(second));
	zassert_mem_equal(adc_dsp_chains[chain_id].stages[0].data,
	                  expect,
	                  sizeof(expect),
	                  "assembled stage bytes must match the two pushed chunks");
}

